:PROPERTIES:
:ID:       f38730e0-1f42-42e3-b173-e12535e55bcd
:END:
#+TITLE: Smallstep: CA, Policy and Provisioner Configuration
#+CATEGORY: slips
#+TAGS:
#+PROPERTY: header-args+ :comments none

**** PIV

#+begin_src shell :results output
# also in :properties
yk5root=12345678 # ykroot="$(ykman list -s | grep 123)"
ykpivpin=123456
ykpivpuk=12345678

# echo $(date +%s) | sha256sum | head -c48 # defaults to aes192
ykpivmgmt_default=010203040506070801020304050607080102030405060708
ykpivmgmt=7eea8019e3c3042a33db408e8682efb5b3c415c52cee4952

# set mgmt key first. needed to set-retries (which resets PIN/PUK)
ykman -d "$yk5root" piv access change-management-key -P $(echo $ykpivpin) \
    -t -a aes192 -m $ykpivmgmt_default -n $ykpivmgmt
ykman -d "$yk5root" piv access set-retries -P $(echo $ykpivpin | rev) -m $(echo -m $ykpivmgmt)  7 7
ykman -d "$yk5root" piv access change-pin -P $(echo $ykpivpin) -n $(echo $ykpivpin | rev)
ykman -d "$yk5root" piv access change-puk -p $(echo $ykpivpuk) -n $(echo $ykpivpuk | rev)
#+end_src

PIN/Touch policies need to be set before import/generate [[https://docs.yubico.com/yesdk/users-manual/application-piv/pin-touch-policies.html#setting-keys-to-a-non-default-policy-all-slots-other-than-80-81-9b-f9][Non-default pin/touch
policies for PIV slots]]

Generate on =9c= which will contain the second =ICA=

#+begin_src shell :results output code :wrap example :var ykpivmgmt="7eea8019e3c3042a33db408e8682efb5b3c415c52cee4952"
ykman -d "$yk5root" piv keys generate -F pem -a ed25519 \
    --pin-policy always --touch-policy always \
    -P $(echo $ykpivpin | rev) -m $(echo $ykpivmgmt) \
    9c -
#+end_src

#+RESULTS:
#+begin_example
-----BEGIN PUBLIC KEY-----
MCowBQYDK2VwAyEA+abPSAzd8FYX/IX3DfMf0QbjvkWR2Qh6bU41vimRce4=
-----END PUBLIC KEY-----
#+end_example

***** ykbootstrap.yaml
:PROPERTIES:
:header-args+: :var y=".step.ykbootstrap/root.yaml"
:END:

| y  | .step.ykbootstrap/root.yaml |

Sops Schema



Create an initial sops yaml file

#+begin_src shell :results output code :wrap example yaml
export SOPS_AGE_KEY_FILE
sops edit $y
# ykbootstrap:
#     ca2:
#         provisioners:
#             - name_unencrypted: admin
#               kms_unencrypted:
#     ca1:
#         provisioners:
#             - name_unencrypted: admin
#     root:
#         provisioners:
#             - name_unencrypted: admin
#+end_src

#+begin_src shell :results output code :wrap example yaml
export SOPS_AGE_KEY_FILE
d=$(date +%s) # not great
# v=$(echo $d | sha256sum | base64 | head -c32)
k='["ykbootstrap"]["root"]["password"]'
v=Yzk1NWQ2ZjlhYzUwMDQ1MTJmZmY4NThky

sops set --value-file $y $k <(echo "\"$v\"")

k='["ykbootstrap"]["ca1"]["password"]'
v=$(echo $v | rev)
sops set --value-file $y $k <(echo "\"$v\"")

# no password for the ca2, since it's on the key

cat $y
#+end_src

#+RESULTS:
#+begin_example yaml
ykbootstrap:
    ca1:
        provisioners:
            - name_unencrypted: admin
        password: ENC[AES256_GCM,data:wJVG0zfHJCRy4hR4YzOtlR/7aDqx1T85fZ+5EWBmOcRV,iv:2QwxT0LnqC2X4jU801XTepdpbuCP58CCOueIrXglX7I=,tag:L9Ungs/eEKRgmgSwosIx4g==,type:str]
    root:
        provisioners:
            - name_unencrypted: admin
        password: ENC[AES256_GCM,data:HsS17m1Nlfa3xbgu8ZSaVMqir1SNE8wfgVW14SpD4m33,iv:sa6m6f+npabR517xTIAkBbC1/5WynBFwBFLxPCL7SFc=,tag:fSEt+U+aZyf2sGGAaRZCqA==,type:str]
sops:
    age:
        - recipient: age1n49hgtpev0deasvk85lwr4s79e33wxlg0zyq7vlgc7jxn8rz649sk00ds8
          enc: |
            -----BEGIN AGE ENCRYPTED FILE-----
            YWdlLWVuY3J5cHRpb24ub3JnL3YxCi0+IFgyNTUxOSBmUld3ejlqSmNGcjhrNzFp
            d0hPR2pRWUZXM3ZZWUpReUlFeElNNnRMYTFVCnh6a3FGOHRITGpqR3ltLy9UNUpX
            NjVmcXE3NDB6WW1kalpOeWJXU2JJMkUKLS0tIGlIN0s2VE5vTVc0MHVPeTVRK2RC
            OW4zVzBWT3lrSXI5OUY2YUNsb2NSOUUKlCOEWMVq2WyMtmonHgD6sICy0tA0Cstj
            aJGVsJUgE1iwgCfzqzyVf3odynmpeLjYwoXatQ9tggX/+FnS3rDvsQ==
            -----END AGE ENCRYPTED FILE-----
        - recipient: age10g7nyzg2llvav0hjyrt3g8yet2huhe4vq9c5jmsde9x4sn7j9vzsy6s2d9
          enc: |
            -----BEGIN AGE ENCRYPTED FILE-----
            YWdlLWVuY3J5cHRpb24ub3JnL3YxCi0+IFgyNTUxOSBISVNzL0xJRmZDV0M2U29N
            TFZOQWsySEV5WEt6a1lhdHdIeXE0NS9XSEdNCm5yVFY4NTNYZE9VZitWQTVkQ0Nh
            RzNkVEhCRTBQRThGUTVWOWd2ODFFcmsKLS0tIGpHUmFlaVFBMkVmOTdKZGRaSGVO
            ekxGZXR3eWRENHRIOXJOTWxmSGg2U3cKtKpcleeBb9bKzT8+ZqV7/ldaOJrRwDfT
            xF+4iXcP+Zk2ugvbaJit7uhyc5yyV1bLdVFu6tC5+z8gdq+fU6EFtA==
            -----END AGE ENCRYPTED FILE-----
    lastmodified: "2025-11-23T19:41:10Z"
    mac: ENC[AES256_GCM,data:IftsY77hCCemAKE4v8bxo1RtinLie15TafvnIAcy+McRqNpAjOBj+aOIWALT4fmQWzwgqu60okaBryNcAzhK/0TUPG6IuEXnLO3QFeYusxjay1uEq0jivuZTN43ovU+QqxJ3Mgrf40/n8WO6uZ2WGbATmaAcJbKmg4abvhwXB3c=,iv:tsYK7N+kggxT6N3a0Mc93h03haxJSkDBF/ORqYlipuo=,tag:+7rq9mW4hl7/uM4X4SURVA==,type:str]
    unencrypted_suffix: _unencrypted
    mac_only_encrypted: true
    version: 3.11.0
#+end_example

Ensure =yq -Y .= to retain multiline strings like =enc: |=, otherwise you get line
breaks.

#+begin_src shell :results output code :wrap example yaml
yq . -Y $y
#+end_src

Add secrets

#+begin_src shell

#+end_src

#+RESULTS:

**** Age

Create keys (some of these tools may reset the key)

+ x25519 keys are not available yet with (see [[https://github.com/str4d/age-plugin-yubikey/issues/174][str4d/age-plugin-yubikey#174]] and
  [[https://github.com/iqlusioninc/yubikey.rs/pull/577][iqlusioninc/yubikey.rs#577]]) and the UX may be a bit clunky, if it's at all
  like the extant workarounds
+ =ssh-to-age= from mic92/sops-nix only mentions x25519 keys
+ manually pushing x25519 to yubikey slot won't work naively (idk)

#+begin_src shell
mkdir {.age,.ssh} && chmod 700 {.age,ssh}

#userid=alice.id25519.pem
#svc1id=svc1.id25519.pem
#host1d=host1.id25519.pem
admin1=alice.age.id_25519
age-keygen > .age/$admin1.txt
admin1pub=$(age-keygen -y .age/$admin1.txt)
#+end_src

Using =ssh-keygen=

#+begin_src shell
admin2=bob.ssh.id_25519
ssh-keygen -t ed25519 -f .ssh/$admin2
nix shell nixpkgs#ssh-to-age --command ssh-to-age -private-key -i .ssh/$admin2 > .age/$admin2.txt
#+end_src

Encrypt/delete the loose AGE keyfiles except =.age/keys.txt= after concatting them.
Then set ~SOPS_AGE_KEY_FILE=.age/keys.txt~ when decrypting with sops.

#+begin_src shell
cat .age/{alice,bob}*25519.txt | grep -ve '^#'
#+end_src

#+RESULTS:
| AGE-SECRET-KEY-1RNCQT3XW208JSFER458MAAWCE2RTFVSHUHUNN2W809ML5Z6CM3AQ8YWSP4 |
| AGE-SECRET-KEY-18XK52JWFZQSH0QH7HNCC94RJNNZ6GA3URKLN0QZKQZYMWVKYV34SVT9MCD |

#+begin_src shell
age-keygen -y <(cat .age/{alice,bob}*25519.txt | grep -ve '^#')
#+end_src

#+RESULTS:
| age1n49hgtpev0deasvk85lwr4s79e33wxlg0zyq7vlgc7jxn8rz649sk00ds8 |
| age10g7nyzg2llvav0hjyrt3g8yet2huhe4vq9c5jmsde9x4sn7j9vzsy6s2d9 |

*** Certs

#+name: stepJsonMerges
#+begin_src emacs-lisp :var a-merges='(((id . 42) (foo . 43)) ((id . 43)))
(json-encode (apply #'a-merge a-merges))
#+end_src

#+RESULTS: stepJsonMerges
: {"id":43,"foo":43}

Certificate

#+begin_src plantuml :noweb-ref x509Certificate
json certificate {
  "version": 3,
  "subject": {
    "commonName": "TheCommonName",
    "extraNames": [{"type":"1.2.840.113549.1.9.1", "value":"jane@example.com"}]
  },
  "rawSubject": "deadbeef",
  "issuer": "issuerCommonName",
  "serialNumber": "0x1234567890",
  "dnsNames": ["foo.bar.com", "baz.qux.org"],
  "emailAddresses": ["foo@bar.com"],
  "ipAddresses": ["123.231.123.231"],
  "uris": ["https://doe.com"],
  "sans": [
        {"type": "dns", "value": "backend.example.com"},
        {"type": "email", "value": "jane@example.com"},
        {"type": "ip", "value": "10.0.1.10"},
        {"type": "uri", "value": "https://backend.example.com/root.crt"}
  ],
  "notBefore": "2009-02-13T23:31:30Z",
  "notAfter": "2009-02-14T23:31:30Z",
  "extensions": [{"id":"1.2.3.4","critical":true,"value":"ZXh0ZW5zaW9u"}],
  "keyUsage": ["digitalSignature"],
  "extKeyUsage": ["serverAuth"],
  "unknownExtKeyUsage": ["1.3.6.1.4.1.44924.1.6", "1.3.6.1.4.1.44924.1.7"],
  "subjectKeyId": "c3ViamVjdEtleUlk",
  "authorityKeyId": "YXV0aG9yaXR5S2V5SWQ=",
  "ocspServer": "https://ocsp.server",
  "issuingCertificateURL": "https://ca.com",
  "crlDistributionPoints": "https://ca.com/ca.crl",
  "policyIdentifiers": {},
  "basicConstraints": {
    "isCA": false,
    "maxPathLen": 0
  },
  "nameConstraints": { "critical": true, "permittedDNSDomains": "jane.doe.com" },
  "signatureAlgorithm": "Ed25519",
  "publicKeyAlgorithm": "Ed25519"
}
#+end_src

Name

#+begin_src plantuml :noweb-ref x509Name
json name {
  "country": ["US"],
  "organization": ["Org1"],
  "organizationalUnit": ["Org1 OU1", "Org1 OU2"],
  "locality": [],
  "province": [],
  "streetAddress": [],
  "postalCode": [],
  "serialNumber": "",
  "commonName": "TheCommonName",
  "extraNames": [{"type":"1.2.840.113549.1.9.1", "value":"jane@example.com"}]
}
#+end_src

Name Constraints

#+begin_src plantuml :noweb-ref x509NameConstraints
json nameConstraints {
  "critical": false,
  "permittedDNSDomains": ["doe.com"],
  "excludedDNSDomains": ["doe.org"],
  "permittedIPRanges": ["1.2.3.0/24"],
  "excludedIPRanges": ["3.2.1.0/24"],
  "permittedEmailAddresses": ["jane@doe.com"],
  "excludedEmailAddresses": ["jane@doe.org"],
  "permittedURIDomains": ["https://doe.com"],
  "excludedURIDomains": ["https://doe.org"]
}
#+end_src


